In [5]:
import pandas as pd

data = {
    "class": ["A", "A", "B", "B"],
    "name": ["철수", "영희", "민수", "지수"],
    "score": [80, 90, 70, 85]
}
df = pd.DataFrame(data)
print(data)
df

{'class': ['A', 'A', 'B', 'B'], 'name': ['철수', '영희', '민수', '지수'], 'score': [80, 90, 70, 85]}

  class name  score
0     A   철수     80
1     A   영희     90
2     B   민수     70
3     B   지수     85

In [15]:
gr = df.groupby('class')

for key, value in gr['score']:
    print(key)
    print(value)
    print(type(value))

A
0    80
1    90
Name: score, dtype: int64
<class 'pandas.core.series.Series'>
B
2    70
3    85
Name: score, dtype: int64
<class 'pandas.core.series.Series'>

In [17]:
print(df.groupby('class')['score'].mean())

class
A    85.0
B    77.5
Name: score, dtype: float64

In [40]:
data1 = {
    '학급': ['A', 'A', 'B', 'B', 'C', 'C'],
    '이름': ['철수', '영희', '민수', '수진', '지훈', '혜진'],
    '수학': [90, 80, 70, 85, 60, 95],
    '영어': [85, 88, 75, 70, 95, 90]
}
df1 = pd.DataFrame(data1)
df1_mean = df1.groupby('학급')[ ['수학', '영어'] ].mean().reset_index()
print(df1_mean)
print(df1_mean.shape)

  학급    수학    영어
0  A  85.0  86.5
1  B  77.5  72.5
2  C  77.5  92.5
(3, 3)

In [ ]:
df2_mean = df1.groupby('학급')[ ['수학', '영어'] ].mean()
print(df2_mean)
print(df2_mean.shape)

SyntaxError: invalid syntax (288029847.py, line 3)

In [47]:
gr = df1.groupby('학급')[ '수학' ].mean()
print(gr)
print(gr.shape)

학급
A    85.0
B    77.5
C    77.5
Name: 수학, dtype: float64
(3,)

In [51]:
gr = df1.groupby('학급')[ '수학' ].agg(['mean', 'max', 'count'])
gr

    mean  max  count
학급
A   85.0   90      2
B   77.5   85      2
C   77.5   95      2

In [53]:
df1['수학'].mean()

np.float64(80.0)

In [58]:
print(df1)
df1.groupby("학급").describe()

  학급  이름  수학  영어
0  A  철수  90  85
1  A  영희  80  88
2  B  민수  70  75
3  B  수진  85  70
4  C  지훈  60  95
5  C  혜진  95  90

      수학                                                     영어        \
   count  mean        std   min    25%   50%    75%   max count  mean
학급
A    2.0  85.0   7.071068  80.0  82.50  85.0  87.50  90.0   2.0  86.5
B    2.0  77.5  10.606602  70.0  73.75  77.5  81.25  85.0   2.0  72.5
C    2.0  77.5  24.748737  60.0  68.75  77.5  86.25  95.0   2.0  92.5


         std   min    25%   50%    75%   max
학급
A   2.121320  85.0  85.75  86.5  87.25  88.0
B   3.535534  70.0  71.25  72.5  73.75  75.0
C   3.535534  90.0  91.25  92.5  93.75  95.0

In [ ]:
print(df1.groupby('학급')[ '수학' ].agg(['mean', 'max', 'count']))
df1.groupby('학급').agg(
    수학평균=('수학', 'mean'), 영어평균=('영어', 'mean'),
    수학최고=('수학', 'max'),  영어최고=('영어', 'max'),
)

    mean  max  count
학급
A   85.0   90      2
B   77.5   85      2
C   77.5   95      2

    수학평균  영어평균  수학최고  영어최고
학급
A   85.0  86.5    90    88
B   77.5  72.5    85    75
C   77.5  92.5    95    95